{
    "Spell Lists": {
        "Bard": {
            "Cantrips": [
                "Horrid Chant"
            ],
            "1st Level": [],
            "2nd Level": [],
            "3rd Level": [],
            "4th Level": [],
            "5th Level": [],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Cleric": {
            "Cantrips": [
                "Spare the Dying",
                "Horrid Chant"
            ],
            "1st Level": [
                "Detect Faith"
            ],
            "2nd Level": [],
            "3rd Level": [],
            "4th Level": [],
            "5th Level": [
                "See the Lies"
            ],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Druid": {
            "Cantrips": [],
            "1st Level": [
                "Lay Waste"
            ],
            "2nd Level": [],
            "3rd Level": [],
            "4th Level": [
                "Channel Mortality",
                "Raze to the Ground"
            ],
            "5th Level": [],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Paladin": {
            "Cantrips": [
                "Detect Faith"
            ],
            "1st Level": [],
            "2nd Level": [
                "Wrecking Weapon",
                "Ward Against the Unknown"
            ],
            "3rd Level": [],
            "4th Level": [
                "Channel Mortality"
            ],
            "5th Level": [
                "See the Lies"
            ],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Ranger": {
            "Cantrips": [],
            "1st Level": [],
            "2nd Level": [
                "Wrecking Weapon",
                "Ward Against the Unknown"
            ],
            "3rd Level": [],
            "4th Level": [
                "Channel Mortality"
            ],
            "5th Level": [],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Sorcerer": {
            "Cantrips": [],
            "1st Level": [
                "Lay Waste"
            ],
            "2nd Level": [
                "Ward Against the Unknown"
            ],
            "3rd Level": [],
            "4th Level": [
                "Channel Mortality",
                "Raze to the Ground"
            ],
            "5th Level": [],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Warlock": {
            "Cantrips": [
                "Horrid Chant"
            ],
            "1st Level": [
                "Lay Waste"
            ],
            "2nd Level": [
                "Ward Against the Unknown"
            ],
            "3rd Level": [],
            "4th Level": [
                "Raze to the Ground"
            ],
            "5th Level": [
                "See the Lies"
            ],
            "6th Level": [],
            "7th Level": [],
            "8th Level": [],
            "9th Level": []
        },
        "Wizard": {
            "Cantrips": [
                "Horrid Chant"
            ],
            "1st Level": [],
            "2nd Level": [],
            "3rd Level": [],
            "4th Level": [],
            "5th Level": [
                "See the Lies"
            ],
            "6th Level": [],
            "7th Level": [
                "Golead's Modify Memory"
            ],
            "8th Level": [],
            "9th Level": []
        }
    },
    "Spell Descriptions": {
        "See the Lies": {
            "content": [
                "*5th Level*",
                "**Casting Time:** 1 action",
                "**Range:** Self (60ft AoE)",
                "**Components:** V, S, M (a mummified ear, and a golden magnifying glass worth at least 50g)",
                "**Duration:** Concentration (10 minutes)",
                "With a light chime that only you can hear, you are notified every time a magical Illusion enters or is cast within 60ft of you for the duration. When you look at an Illusion, and only while you are looking directly at it, the Illusion will appear translucent to only you. Similarly, a low tremble that only you can hear occurs whenever another creature makes a Deception check within 60ft of you for the duration, even when they are speaking a language that you do not understand. If you watch them as they make this Deception check, their words and actions appear to float around them, a vision that only you can see. "
            ]
        },
        "Raze to the Ground": {
            "content": [
                "*4nd Level*",
                "**Casting Time:** 1 action",
                "**Range:** Self (30ft cone)",
                "**Components:** S, M (flint and rodent bones)",
                "**Duration:** 1 hours",
                "With your fingers twisted into a claw, a wave of destruction sweeps before you. Each creature with the 30ft cone must make a Dexterity saving throw. They take 5d6 Necrotic damage on a failed save, or half as much damage on a successful one. Flammable objects and creatures in this area are afflicted with the Burning condition for 1 hour. If the cone’s area includes the ground, the area becomes Desecrated Land for 1 hour.\nAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 for each slot level above 4rd."
            ]
        },
        "Channel Mortality": {
            "content": [
                "*4nd Level*",
                "**Casting Time:** 1 action",
                "**Range:** Self",
                "**Components:** V, M (an enchanted slashing or piercing weapon worth at least 300g)",
                "**Duration:** 8 hours",
                "After a droll incantation that ends with a swift stab, you turn what would have been a serious self-inflicted wound into a surge of power, using your own life force as the catalyst. The damage that you deal with spells and class features ignores the damage reduction of Resistances, for the duration. Furthermore, the damage you deal with a spell or class feature is only halved when harming a creature that would otherwise be Immune to the damage, for the duration."
            ]
        },
        "Ward Against the Unknown": {
            "content": [
                "*2nd Level*",
                "**Casting Time:** 1 action",
                "**Range:** Touch",
                "**Components:** V, S, M (a Perilous Pebble, consumed)",
                "**Duration:** 10 minutes",
                "One willing creature you touch is protected from the most common forms of deific assault. The ward grants immunity to the Afraid, Blinded, Deafened and Terrified conditions for the duration."
            ]
        },
        "Wreaking Weapon": {
            "content": [
                "*2nd Level*",
                "**Casting Time:** 1 bonus action",
                "**Range:** Touch",
                "**Components:** V, S",
                "**Duration:** 10 minutes",
                "You strike a weapon upon the ground in front of you in a dramatic flourish, filling your weapon with a fleeting yet stubborn power. The weapon’s damage ignores the damage reduction of Resistances, for the duration. Furthermore, the weapon’s damage is only halved when striking a creature that would otherwise be Immune to the weapon’s damages, for the duration.\nAt Higher Levels: When you cast this spell using a 3rd level spell slot, you can affect an additional weapon for each slot above 2nd."
            ]
        },
        "Lay Waste": {
            "content": [
                "*1st Level*",
                "**Casting Time:** 1 action (ritual)",
                "**Range:** Self (20ft line, 5ft wide)",
                "**Components:** V, S, M (a Perilous Pebble)",
                "**Duration:** 24 hours",
                "You release a wave of lethargy, darkening the ground before you. The affected area becomes Desecrated Land for the duration, and non-magical plants within it visibly wilt and dry out. Casting this spell onto Desecrated Land also makes the area Rough Terrain. Casting this spell onto the same area 3 days in a row will make the Desecrated Land effect along that area permanent.\nAt Higher Levels: When you cast this spell using a 2nd level spell slot, the affected area increases by (+10ft line, +0ft wide) for each slot level above 1st."
            ]
        },
        "Detect Faith": {
            "content": [
                "*1st Level*",
                "**Casting Time:** 1 action",
                "**Range:** Self",
                "**Components:** V, S",
                "**Duration:** Concentration, 10 min",
                "For the duration, you sense the presence of religious faith in creatures within 30ft of you. If you sense faith in this way, you can use your action to see a faint aura around any visible creature that holds religious faith, and you learn the name of the entity that they have faith in.\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
            ]
        },
        "Horrid Chant": {
            "content": [
                "*Cantrip*",
                "**Casting Time:** 1 action",
                "**Range:** Self",
                "**Components:** V",
                "**Duration:** Concentration, 1 min",
                "You recite unholy scripture that surrounds you in a sinister whirl of desecrating energy. You treat your space, and the spaces adjacent to you as Desecrated Land for the duration."
            ]
        },
        "Spare the Dying": {
            "content": [
                "*Cantrip*",
                "**Casting Time:** 1 action",
                "**Range:** Touch",
                "**Components:** V, S",
                "**Duration:** Instantaneous",
                "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs."
            ]
        },
        "Golead's Modify Memory": {
            "content": [
                "*7th-level enchantment*",
                "**Casting Time:** 1 action",
                "**Range:** Touch",
                "**Components:** V, S",
                "**Duration:** Forever or Temporary",
                "1x/day, when you touch a creature that sees you as an ally, temporarily or otherwise, you may choose to make them forget meeting you, and ever having known you. Their memories that included you will either omit you, or replace you, where appropriate. If there are images of you that the target owns, you fade from the image, leaving only a vanta black silhouette and a vague recollection that the target knew the Golead"
            ]
        }
    }
}